Revit 2027 API
UIApplication.IsViewerModeActive Property
Note: This API is now obsolete.
 Determines if Revit session is in Viewer mode.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public bool IsViewerModeActive { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public ReadOnly Property IsViewerModeActive As Boolean
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property bool IsViewerModeActive {
	bool get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member IsViewerModeActive : bool with get
Property Value
Boolean
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace